<script lang="ts">
import { computed, defineComponent, onMounted, ref, watch } from 'vue';
import { useRouter } from 'vue-router';
import { useStore } from 'vuex';
import KpButton from '@components/common/KpButton.vue';
import KpImage from '@components/common/KpImage.vue';
import KpLink from '@components/common/KpLink.vue';
import { TermsInterface } from '@src/types/types';
import { SET_TERMS_AGREE_LIST } from '@src/store/actions';
import LayoutHeader from '@components/layout/header/LayoutHeader.vue';

export default defineComponent({
	name: 'Terms',
	components: { LayoutHeader, KpLink, KpImage, KpButton },
	setup() {
		const router = useRouter();
		const store = useStore();
		const terms = ref<TermsInterface[]>([
			{
				types: 'SERVICE',
				title: '[필수] 위치정보 이용약관',
				body:
					'버디케어 서비스 위치정보 이용약관\n' +
					'제 1 장 총칙\n' +
					'\n' +
					'제 1 조 (목적)\n' +
					'본 약관은 회원 (버디케어 서비스 약관에 동의한 자를 말합니다. 이하 "회원"이라고 합니다.)이 주식회사 키핀 (이하 "회사"라고 합니다.)이 제공하는 버디케어 서비스(이하 "서비스"라고 합니다)를 이용함에 있어 회사와 회원의 권리·의무 및 책임사항을 규정함을 목적으로 합니다.\n' +
					' \n' +
					'제 2 조 (이용약관의 효력 및 변경)\n' +
					'① 본 약관은 서비스를 신청한 고객 또는 개인위치정보주체가 본 약관에 동의하고 회사가 정한 소정의 절차에 따라 서비스의 이용자로 등록함으로써 효력이 발생합니다.\n' +
					'② 회원이 온라인에서 본 약관의 "동의하기" 버튼을 클릭하였을 경우 본 약관의 내용을 모두 읽고 이를 충분히 이해하였으며, 그 적용에 동의한 것으로 봅니다.\n' +
					'③ 회사는 위치정보의 보호 및 이용 등에 관한 법률, 콘텐츠 산업 진흥법, 전자상거래 등에서의 소비자보호에 관한 법률, 소비자 기본법 약관의 규제에 관한 법률 등 관련법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.\n' +
					'④ 회사가 약관을 개정할 경우에는 기존 약관과 개정약관 및 개정약관의 적용 일자와 개정사유를 명시하여 현행 약관과 함께 그 적용일자 10일 전부터 적용일 이후 상당한 기간 동안 공지 만을 하고, 개정 내용이 회원에게 불리한 경우에는 그 적용일자 30일 전부터 적용일 이후 상당한 기간 동안 각각 이를 서비스 홈페이지에 게시하거나 회원에게 전자적 형태(전자우편, SMS 등)로 약관 개정 사실을 발송하여 고지합니다.\n' +
					'⑤ 회사가 전항에 따라 회원에게 통지하면서 공지 또는 공지ㆍ고지일로부터 개정약관 시행일 7일 후까지 거부의사를 표시하지 아니하면 이용약관에 승인한 것으로 봅니다. 회원이 개정약관에 동의하지 않을 경우 회원은 이용계약을 해지할 수 있습니다.\n' +
					' \n' +
					'제 3 조 (관계법령의 적용)\n' +
					'본 약관은 신의성실의 원칙에 따라 공정하게 적용하며, 본 약관에 명시되지 아니한 사항에 대하여는 관계법령 또는 상관례에 따릅니다.\n' +
					'\n' +
					'제 4 조 (서비스의 내용)\n' +
					'회사가 제공하는 서비스는 아래와 같습니다.\n' +
					'서비스 명칭 - 버디케어\n' +
					'기본 서비스 내용 - 버디케어 서비스는 웨어러블 기기로 사용자의 건강정보와 위치정보를 보호자등에게 공유하고 서로 채팅 기능을 통해 그룹 돌봄 기능을 제공합니다.\n' +
					'추가 디바이스 구입 시 서비스 내용\n' +
					'1. 건강정보(심박수, 체온, 혈압, 산소포화도등)를 스마트워치에서 수집하고, 이를 블루투스로 연결한 스마트폰으로 전송하고, 스마트폰은 인터넷으로 통해 서버로 전송하여 앱으로 건강 정보을 확인하는 서비스\n' +
					'2. 스마트워치에서 걸음수를 수집하고, 이를 블루투스로 연결한 스마트폰으로 전송하고, 스마트폰은 인터넷을 통해 서버로 전송하여 앱으로 걸음기록을 확인하는 서비스\n' +
					'3. 스마트폰에서 GPS위치를 수집하고 인터넷을 통해 서버로 전송하여 앱으로 위치를 확인하는 서비스 (사용자가 앱을 통해 선택한 경우에 한함)\n' +
					' \n' +
					'제 5 조 (서비스 이용요금)\n' +
					'① 회사가 제공하는 서비스는 기본적으로 무료입니다. 단, 별도의 유료 서비스의 경우 해당 서비스에 명시된 요금을 지불하여야 사용 가능합니다.\n' +
					'② 회사는 유료 서비스 이용요금을 회사와 계약한 전자지불업체에서 정한 방법에 의하거나 회사가 정한 청구서에 합산하여 청구할 수 있습니다.\n' +
					'③ 유료서비스 이용을 통하여 결제된 대금에 대한 취소 및 환불은 회사의 결제 이용약관 등 관계법에 따릅니다.\n' +
					'④ 회원의 개인정보도용 및 결제 사기로 인한 환불요청 또는 결제자의 개인정보 요구는 법률이 정한 경우 외에는 거절될 수 있습니다.\n' +
					'⑤ 무선 서비스 이용 시 발생하는 데이터 통신료는 별도이며 가입한 각 이동통신사의 정책에 따릅니다.\n' +
					'⑥ MMS 등으로 게시물을 등록할 경우 발생하는 요금은 이동통신사의 정책에 따릅니다.\n' +
					' \n' +
					'제 6 조 (서비스 내용 변경 통지 등)\n' +
					'① 회사가 서비스 내용을 변경하거나 종료하는 경우 회사는 회원의 등록된 전자우편 주소로 이메일을 통하여 서비스 내용의 변경 사항 또는 종료를 통지할 수 있습니다.\n' +
					'② ①항의 경우 불특정 다수인을 상대로 통지를 함에 있어서는 웹사이트 등 기타 회사의 공지사항을 통하여 회원들에게 통지할 수 있습니다.\n' +
					' \n' +
					'제 7 조 (서비스이용의 제한 및 중지)\n' +
					'① 회사는 아래 각 호의 1에 해당하는 사유가 발생한 경우에는 회원의 서비스 이용을 제한하거나 중지시킬 수 있습니다.\n' +
					'1. 회원이 회사 서비스의 운영을 고의 또는 중과실로 방해하는 경우\n' +
					'2. 서비스용 설비 점검, 보수 또는 공사로 인하여 부득이한 경우\n' +
					'3. 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우\n' +
					'4. 국가비상사태, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 서비스 이용에 지장이 있는 때\n' +
					'5. 기타 중대한 사유로 인하여 회사가 서비스 제공을 지속하는 것이 부적당하다고 인정하는 경우\n' +
					'② 회사는 전항의 규정에 의하여 서비스의 이용을 제한하거나 중지한 때에는 그 사유 및 제한기간 등을 회원에게 알려야 합니다.\n' +
					' \n' +
					'제 8 조 (개인위치정보의 이용 또는 제공)\n' +
					'① 회사는 개인위치정보를 이용하여 서비스를 제공하고자 하는 경우에는 미리 이용약관에 명시한 후 개인위치정보주체의 동의를 얻어야 합니다.\n' +
					'② 회원 및 법정대리인의 권리와 그 행사 방법은 제소 당시의 이용자의 주소에 의하며, 주소가 없는 경우에는 거소를 관할하는 지방법원의 전속관할로 합니다. 다만, 제소 당시 이용자의 주소 또는 거소가 분명하지 않거나 외국 거주자의 경우에는 민사소송법상의 관할법원에 제기합니다.\n' +
					'③ 회사는 타사업자 또는 이용 고객과의 요금정산 및 민원처리를 위해 위치정보 이용·제공, 사실 확인자료를 자동 기록·보존하며, 해당 자료는 1년간 보관합니다.\n' +
					'④ 회사는 개인위치정보를 회원이 지정하는 제3자에게 제공하는 경우에는 개인위치정보를 수집한 당해 통신 단말 장치로 매회 회원 에게 제공받는 자, 제공 일시 및 제공 목적을 즉시 통보합니다. 단, 아래 각 호의 1에 해당하는 경우에는 회원이 미리 특정하여 지정한 통신 단말 장치 또는 전자우편주소로 통보합니다.\n' +
					'1. 개인위치정보를 수집한 당해 통신단말장치가 문자, 음성 또는 영상의 수신 기능을 갖추지 아니한 경우\n' +
					'2. 회원이 온라인 게시 등의 방법으로 통보할 것을 미리 요청한 경우\n' +
					' \n' +
					'제 9 조 (개인위치정보주체의 권리)\n' +
					'① 회원은 회사에 대하여 언제든지 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제3자 제공에 대한 동의의 전부 또는 일부를 철회할 수 있습니다. 이 경우 회사는 수집한 개인위치정보 및 위치정보 이용, 제공 사실 확인자료를 파기합니다.\n' +
					'② 회원은 회사에 대하여 언제든지 개인위치정보의 수집, 이용 또는 제공의 일시적인 중지를 요구할 수 있으며, 회사는 이를 거절할 수 없고 이를 위한 기술적 수단을 갖추고 있습니다.\n' +
					'③ 회원은 회사에 대하여 아래 각 호의 자료에 대한 열람 또는 고지를 요구할 수 있고, 당해 자료에 오류가 있는 경우에는 그 정정을 요구할 수 있습니다. 이 경우 회사는 정당한 사유 없이 회원의 요구를 거절할 수 없습니다.\n' +
					'1. 본인에 대한 위치정보 수집, 이용, 제공 사실 확인자료\n' +
					'2. 본인의 개인위치정보가 위치정보의 보호 및 이용 등에 관한 법률 또는 다른 법률 규정에 의하여 제3자에게 제공된 이유 및 내용\n' +
					'④ 회원은 제1항 내지 제3항의 권리행사를 위해 회사의 소정의 절차를 통해 요구할 수 있습니다.\n' +
					' \n' +
					'제 10 조 (법정대리인의 권리)\n' +
					'① 회사는 14세 미만의 회원에 대해서는 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제3자 제공에 대한 동의를 당해 회원과 당해 회원의 법정대리인으로부터 동의를 받아야 합니다. 이 경우 법정대리인은 제9조에 의한 회원의 권리를 모두 가집니다.\n' +
					'② 회사는 14세 미만의 아동의 개인위치정보 또는 위치정보 이용, 제공 사실 확인자료를 이용약관에 명시 또는 고지한 범위를 넘어 이용하거나 제3자에게 제공하고자 하는 경우에는 14세 미만의 아동과 그 법정대리인의 동의를 받아야 합니다. 단, 아래의 경우는 제외합니다.\n' +
					'1. 위치정보 및 위치기반서비스 제공에 따른 요금 정산을 위하여 위치정보 이용, 제공 사실 확인 자료가 필요한 경우\n' +
					'2. 통계작성, 학술연구 또는 시장조사를 위하여 특정 개인을 알아볼 수 없는 형태로 가공하여 제공하는 경우\n' +
					' \n' +
					'제 11 조 (8세 이하의 아동 등의 보호의무자의 권리)\n' +
					'① 회사는 아래의 경우에 해당하는 자(이하 “8세 이하의 아동”등이라 한다)의 보호의무자가 8세 이하의 아동 등의 생명 또는 신체 보호를 위하여 개인위치정보의 이용 또는 제공에 동의하는 경우에는 본인의 동의가 있는 것으로 봅니다.\n' +
					'1. 8세 이하의 아동\n' +
					'2. 금치산자\n' +
					'3. 장애인복지법 제2조 제2항 제2호의 규정에 의한 정신적 장애를 가진 자로서 장애인 고용촉진 및 직업재활법 제2조 제2호의 규정에 의한 중증장애인에 해당하는 자 (장애인복지법 제29조의 규정에 의하여 장애인등록을 한 자에 한한다)\n' +
					'② 8세 이하의 아동 등의 생명 또는 신체의 보호를 위하여 개인위치정보의 이용 또는 제공에 동의를 하고자 하는 보호의무자는 서면동의서에 보호의무자임을 증명하는 서면을 첨부하여 회사에 제출하여야 합니다.\n' +
					'③ 보호의무자는 8세 이하의 아동 등의 개인위치정보 이용 또는 제공에 동의하는 경우 개인위치정보주체 권리의 전부를 행사할 수 있습니다.\n' +
					' \n' +
					'제 12조 (위치정보관리책임자의 지정)\n' +
					'① 회사는 위치정보를 적절히 관리·보호하고 개인위치정보주체의 불만을 원활히 처리할 수 있도록 실질적인 책임을 질 수 있는 지위에 있는 자를 위치정보관리책임자로 지정해 운영합니다.\n' +
					'② 위치정보관리책임자는 위치기반서비스를 제공하는 부서의 부서장으로서 구체적인 사항은 본 약관의 부칙에 따릅니다.\n' +
					' \n' +
					'제 13 조 (손해배상)\n' +
					'① 회사가 위치정보의 보호 및 이용 등에 관한 법률 제15조 내지 제26조의 규정을 위반한 행위로 회원에게 손해가 발생한 경우 회원은 회사에 대하여 손해배상 청구를 할 수 있습니다. 이 경우 회사는 고의, 과실이 없음을 입증하지 못하는 경우 책임을 면할 수 없습니다.\n' +
					'② 회원이 본 약관의 규정을 위반하여 회사에 손해가 발생한 경우 회사는 회원에 대하여 손해배상을 청구할 수 있습니다. 이 경우 회원은 고의, 과실이 없음을 입증하지 못하는 경우 책임을 면할 수 없습니다.\n' +
					' \n' +
					'제 14 조 (면책)\n' +
					'① 회사는 다음 각 호의 경우로 서비스를 제공할 수 없는 경우 이로 인하여 회원에게 발생한 손해에 대해서는 책임을 부담하지 않습니다.\n' +
					'1. 천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우\n' +
					'2. 서비스 제공을 위하여 회사와 서비스 제휴계약을 체결한 제3자의 고의적인 서비스 방해가 있는 경우\n' +
					'3. 회원의 귀책사유로 서비스 이용에 장애가 있는 경우\n' +
					'4. 제1호 내지 제3호를 제외한 기타 회사의 고의ㆍ과실이 없는 사유로 인한 경우\n' +
					'② 회사는 서비스 및 서비스에 게재된 정보, 자료, 사실의 신뢰도, 정확성 등에 대해서는 보증을 하지 않으며 이로 인해 발생한 회원의 손해에 대하여는 책임을 부담하지 아니합니다.\n' +
					' \n' +
					'제 15 조 (규정의 준용)\n' +
					'① 본 약관은 대한민국법령에 의하여 규정되고 이행됩니다.\n' +
					'② 본 약관에 규정되지 않은 사항에 대해서는 관련법령 및 상관습에 의합니다.\n' +
					' \n' +
					'제 16 조 (분쟁의 조정 및 기타)\n' +
					'① 회사는 위치정보와 관련된 분쟁에 대해 당사자간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 위치정보의 보호 및 이용 등에 관한 법률 제28조의 규정에 의한 방송통신위원회에 재정을 신청할 수 있습니다.\n' +
					'② 회사 또는 고객은 위치정보와 관련된 분쟁에 대해 당사자간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 개인정보보호법 제43조의 규정에 의한 개인정보분쟁조정위원회에 조정을 신청할 수 있습니다.\n' +
					' \n' +
					'제 17 조 (회사의 연락처)\n' +
					'회사의 상호 및 주소 등은 다음과 같습니다.\n' +
					'1. 상호 : 주식회사 키핀\n' +
					'2. 대표자 : 최상준\n' +
					'3. 주소 : 서울시 금천구 새부샛길 606 (가산동, 대성디폴리스 지식산업센터) A동 909호\n' +
					'4. 대표전화 : 070-7700-5662\n' +
					' \n' +
					'부 칙\n' +
					'제1조 (시행일) 이 약관은 2023년 4월 1일부터 시행한다.\n' +
					'제2조 위치정보관리책임자는 2023년 4월 1일을 기준으로 다음과 같이 지정합니다.\n' +
					'1. 소속 : 본사\n' +
					'2. 연락처 : 070-7700-5662',
			},
			{
				types: 'PRIVACY',
				title: '[필수] 개인정보취급방침',
				body:
					'개인정보 보호 활용 보고서 및 이용자 동의사항\n' +
					'\n' +
					'주식회사 키핀은 서비스 사용자의 개인정보를 중요시하며, [정보통신망 이용촉진 및 정보보호 등에 관한 법률], [개인정보보호법]을 준수하기 위하여 노력하고 있습니다. (주)키핀은 보다 다양한 서비스 제공을 위하여 아래와 같이 고객의 개인정보를 수집, 활용합니다.\n' +
					' \n' +
					'0. 총칙\n' +
					'“개인정보”란 생존하는 개인에 관한 정보로서 당해 정보에 포함되어 있는 성명, 주민등록번호 등의 사항에 의하여 당해 개인을 식별할 수 있는 정보(당해 정보만으로는 특정 개인을 식별할 수 없더라도 다른 정보와 용이하게 결합하여 식별할 수 있는 것을 포함)를 말합니다.\n' +
					'\n' +
					'1. 수집하는 개인정보의 항목 및 수집방법 동의\n' +
					'회사는 최초 회원 가입 또는 서비스 이용 시 이용자로 부터 아래와 같은 개인정보를 수집하고 본인은  「개인정보보호법」제15조 제1항 제1호, 제17조 제1항 제1호, 제24조 제1항 제1호에 따라  (주)키핀이 아래의 내용과 같이 본인의 개인정보를 수집․이용하는 것과 본인의 개인정보를 제공․조회하는 것에 동의합니다.\n' +
					' \n' +
					'<개인정보 수집 항목>\n' +
					'\n' +
					'구분: 필수 항목\n' +
					'수집정보: \n' +
					'① 회원가입을 위해 필요한 개인정보\n' +
					'회원의 전화번호(아이디)와 비밀번호\n' +
					'회원의 성명과 주소, 생년월일, 성별\n' +
					'보호자의 유형 (소속일 경우 소속 명, 직업 입력) -보호자만 해당\n' +
					'② 라이프로그 분석을 위해 필요한 착용자 행동 정보\n' +
					'(추가 디바이스 사용시 분석)\n' +
					'정보의 생성 시간, 측정 시간\n' +
					'건강관련정보\n' +
					'일상생활데이터\n' +
					'움직임데이터\n' +
					'③ 서비스 신청 및 이용을 위해 필요한 정보, 서비스 이용기록/구매 또는 AS관련정보\n' +
					'각 서비스 이용 기록 / 구매 또는 AS 관련 정보\n' +
					'단말 및 어플리케이션 정보\n' +
					'      - 단말정보(단말식별번호 포함), 단말의 펌웨어 버전, 주요 설정 값 (비밀번호 설정여부, 삼성 계정 설정여부, 서버 동기화 설정여부)\n' +
					'      - 어플리케이션 내 각종 사용 기록(화면/메뉴 진입, 버튼 선택과 같은 어플리케이션 내 기능 사용, 사용 중 발생하는 오류)\n' +
					'위치정보: 서비스를 제공하기 위하여 필수적인 경우\n' +
					'영상 및 음성 정보: 서비스를 제공하기 위하여 필수적인 경우\n' +
					'서비스 가입을 위해 필요한 정보 : 주소, 우편번호\n' +
					'④ 고객지원을 위한 수집항목\n' +
					'이메일 주소 또는 전화번호, 국가정보 (언어정보), 제품모델명, 서비스 버전 정보, 개인이 입력한 문의 내용\n' +
					'환불신청시 추가 수집 정보(결제하신 방식 등에 따라 다음 중 추가 수집이 필요한 항목이 상이할 수 있음)\n' +
					'계좌 정보(은행, 계좌번호, 계좌주), 연락처(전화번호), 구매 컨텐츠, 결제 일시, 결제 금액, 결제 시 사용한 삼성계정정보, 결제한 휴대폰 번호 및 통신사 또는 신용 카드사 및 승인번호, 결제 취소/ 환불 요청 사유\n' +
					' \n' +
					'<개인정보 수집 및 이용목적>\n' +
					'\n' +
					'목적: \n' +
					'① 회원관리 및 본인확인\n' +
					'상품 구매 및 서비스 이용 시/ 개인정보 처리 및 정보주체의 개인정보열람,정정, 삭제, 처리정지 요구 시 본인확인, 개인식별\n' +
					'② 서비스 제공에 관한 계약 이행 및 요금 정산\n' +
					'상품, 서비스 및 콘텐츠의 제공, 구매 및 요금 결제, 상품 배송\n' +
					'이용자에게 최적화된 서비스 제공 및 기능 개선(이용자의 과거 이용 행태에 기반한 맞춤형 콘텐츠 및 추천 정보 등 제공)\n' +
					'이용자가 구매한 상품에 대한 AS 및 업데이트 정보 등 제공\n' +
					'③ 데이터를 통해 기존서비스 개선, 신규서비스 개발, 연구 및 마케팅 등에 활용\n' +
					'고객만족 조사, 상품 및 서비스 개발연구\n' +
					'건강관리 및 일상생활 케어 관리의 기본통계데이터 활용\n' +
					'서비스 품질향상과 신규서비스제공을 위한 기초데이터 활용 및 연구 데이터 활용\n' +
					'광고성 정보 전달(E-mail 발송, 전화, SMS/MMS/ 푸시 메세지 발송 등), 이벤트 경품 배송, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 접속 빈도 파악 또는 회원의 상품 구매 및 서비스 이용에 대한 분석 및 통계, 서비스/제품/정보의 추천, 시장 트렌드 유추, 시장조사, 통계분석자료 활용, 비회원 구매상담 및 고객문의 응대\n' +
					'④ 맞춤형 서비스 (추가 디바이스 사용시)\n' +
					'이용자 개인의 라이프로그를 바탕으로 일상생활을 케어하는 보조적 기능\n' +
					'이용자 개인의 라이프로그를 데이터베이스에 백업하거나, 단말과 연동하는 목적으로 저장 및 활용\n' +
					'착용자 및 보호자에게 라이프로그를 통해 사고예측지수를 추측하여 사고예방에 도움을 주는 이상감지 서비스\n' +
					'앱을 통해 착용자/보호자에게 일정조건이 되면 ‘알림/권고/이상’을 알려주는 푸시 알림 기능 제공\n' +
					'계정과 연동 가능한 서비스(경고자 대상 메시지 전송, 건강 주간 레포트등) 제공\n' +
					'태그가 부착된 사물을 접촉하는 순간 상황에 따라 맞춤형 음성메시지가 들리는 착용자용 보이스 케어 서비스\n' +
					'보호자가 실시간으로 착용자가의 일상 활동을 확인하여 효율적으로 도움을 줄 수 있는 보호자용 실시간 케어 서비스\n' +
					'케어마스터가 착용자에게 전화/방문을 통해 케어 서비스 (보이스케어, 실시간케어, 이상감지)의 활용성을 높이도록 도와주는 서비스\n' +
					'맞춤형 서비스를 위한 정보는 자동화된 시스템으로 분석하여 각 서비스들에서 맞춤형 컨텐츠와 정보 등을 제공하기 위한 목적, 더 나은 서비스를 제공하기 위한 분석과 서비스 개선 및 개발 목적으로 사용\n' +
					' \n' +
					' \n' +
					'2. 고유식별정보의 수집 및 이용 동의\n' +
					'본인은 아래의 개인정보 항목이 계약의 체결 및 이행을 위하여 불가피하게 필요한 최소한의 것으로서 본인의 동의를 받아야 처리할 수 있는 고유식별정보임을 충분히 인식하며, 아래의 내용을 상세히 고지 받고 그 수집 및 이용에 동의합니다.\n' +
					' \n' +
					'개인정보 항목 : 연락처\n' +
					'수집 및 이용목적 : 착용자 확인\n' +
					'보유 및 이용기간 : 계약기간\n' +
					'동의를 거부할 권리 유무 및 거부 시 불이익 : 계약체결 및 이행을 위하여 불가피하게 필요한 경우로서 동의 거부 불가하여 불가시 계약체결 또는 이행불가\n' +
					' \n' +
					"위의 '개인정보 보호를 위한 이용자 동의사항'에 동의합니다. 회원 여러분의 개인정보를 소중히 여기고 관련법규에 따라 안전하게 보호하겠습니다.\n" +
					' \n' +
					'감사합니다.',
			},
		]);
		const arrowState = ref<Array<any>>([{ state: false }, { state: false }, { state: false }]);
		const btnAccess = ref<boolean>(false);
		const selectList = ref<Array<any>>([]);
		const selectAll = computed({
			get() {
				return terms.value.length === selectList.value.length;
			},
			set(e: boolean) {
				selectList.value = [];
				if (e) {
					terms.value.forEach(terms => {
						selectList.value.push(terms.types);
					});
				}
			},
		});

		const onTermsBtn = () => {
			store.commit(SET_TERMS_AGREE_LIST, selectList.value);
			router.push('/login/join');
		};

		const openContext = (v: number) => {
			arrowState.value[v].state = !arrowState.value[v].state;
		};

		watch(selectList, () => {
			if (selectList.value.length >= 2) {
				const filetList = selectList.value.filter(v => v);
				btnAccess.value = filetList.includes('SERVICE') && filetList.includes('PRIVACY');
			} else {
				btnAccess.value = false;
			}
		});

		onMounted(() => {});

		return {
			store,
			terms,
			selectList,
			selectAll,
			btnAccess,
			arrowState,
			onTermsBtn,
			openContext,
		};
	},
});
</script>

<template>
	<layout-header title="회원가입" />
	<section class="terms flex flex-col h-[calc(100%_-_56px)] px-[20px] pt-[40px]">
		<article class="terms-info flex flex-col flex-1 h-screen">
			<div class="h-full">
				<div class="px-2.5 pb-[5px] main-title">약관동의</div>
				<div class="px-2.5 pb-[30px] sub-title">원활한 서비스를 제공하기 위해<br />위치 및 개인정보에대한 동의가 필요합니다.</div>
				<div class="flex flex-col p-[20px] flex flex-col bg-white rounded-[10px]">
					<div class="all-check-form flex items-center">
						<input id="all" class="w-[25px] h-[25px] border-[1px] border-[#999999] mr-[10px]" type="checkbox" v-model="selectAll" />
						<label for="all">전체 동의</label>
					</div>
					<div class="my-[20px] bg-[#AAB1BB] opacity-50 h-[1px]"></div>
					<div class="single-check-info flex flex-col mb-[16px] last:mb-0" v-for="(item, index) in terms">
						<div class="single-check-form flex flex-row justify-start items-center">
							<input class="w-[25px] h-[25px] mr-[10px]" type="checkbox" :id="item.types" :value="item.types" v-model="selectList" />
							<label :for="item.types" class="mr-[13px]">{{ terms[index].title }}</label>
							<kp-link link="#" @click="openContext(index)">
								<kpImage
									class="transition-all duration-[400ms]"
									:class="arrowState[index].state ? 'rotate-180' : ''"
									:src="`images/common/arrow-icon.svg`" />
							</kp-link>
						</div>
						<div
							class="w-full transition-all duration-[300ms]"
							:class="arrowState[index].state ? 'h-[15px]' : 'h-0'"
							v-if="arrowState[index].state"></div>
						<div class="context-info overflow-auto transition-[height] duration-300" :class="arrowState[index].state ? 'h-[108px]' : 'h-0 mt-0'">
							<div
								class="context-form w-full overflow-scroll pt-[15px] pb-[15px] pl-[10px] pr-[20px] transition-all duration-[300ms]"
								:class="arrowState[index].state ? 'rotate-0 h-[108px]' : 'h-0'">
								<pre class="terms-context whitespace-pre-wrap">{{ terms[index].body }}</pre>
							</div>
						</div>
					</div>
				</div>
			</div>
			<div class="w-full">
				<kp-button class="w-full pt-[16px] pb-[15px] mt-[40px] mb-[60px]" :is-disabled="!btnAccess" @click="onTermsBtn">다음</kp-button>
			</div>
		</article>
	</section>
</template>

<style scoped></style>
